{
  "oralPresentations": [
    "OLIG2 mediates a rare targetable stem cell fate transition in sonic hedgehog medulloblastoma. The Hospital for Sick Children departments of Genetics and Genome Biology (GGB) and Developmental, Stem Cell, and Cancer Biology (DSCB) Scientific Retreat, Blue Mountain, ON, Canada (2025) – invited speaker.",

    "OLIG2 mediates a rare targetable stem cell fate transition in sonic hedgehog medulloblastoma. Pacific Pediatric Neuro-Oncology Consortium and the Children's Brain Tumor Network, virtual presentation to an audience of ~40 clinicians, scientists and patient advocates (2025) – invited speaker with Dr. Dirks.",

    "Cancer in the Era of Personalized Medicine. S. Walter Stewart Toronto Public Library, Toronto, ON, Canada (2025) – invited speaker.",

    "OLIG2 mediates a rare targetable stem cell fate transition in sonic hedgehog medulloblastoma. SickKids Brain Tumour Research Centre Scientific Symposium – Celebrating 25 Years of Breakthrough Science, Toronto, ON, Canada (2024) – invited speaker.",

    "OLIG2 mediates a rare targetable stem cell fate transition in sonic hedgehog medulloblastoma. Childhood Brain Tumour Centre of Excellence International Summer School, Cambridge, England (2024).",

    "New Advances in Cancer Research. Canadian Cancer Society education session, Toronto Public Library, Don Mills branch, Toronto, ON, Canada (2023).",

    "OLIG2 mediates a rare targetable stem cell fate transition in sonic hedgehog medulloblastoma. Canadian Epigenetics, Environment and Health Research Consortium (CEEHRC) 8th Annual Conference on Epigenetics, Estérel, Quebec, Canada (2022) – invited speaker.",

    "OLIG2 mediates a rare targetable stem cell fate transition in sonic hedgehog medulloblastoma. SickKids Developmental and Stem Cell Biology Seminar, Toronto, ON, Canada (2022).",

    "Targeting stem cell activation to suppress medulloblastoma tumorigenesis. SickKids Postdoctoral Association Seminar, Toronto, ON, Canada (2021).",

    "The History and Progress of Cancer Research. Public science lecture hosted virtually by Goethe-Zentrum Hyderabad, India (2020) – invited speaker.",

    "Integrative Genomics Identify Olig2 as a Regulator in SHH Medulloblastoma. SickKids Brain Tumour Research Centre Retreat, Killarney, ON, Canada (2019) – invited speaker.",

    "Integrative Genomics Identifies Regulatory Factors in SHH Medulloblastoma. Princess Margaret Postdoctoral Seminar Series, Toronto, ON, Canada (2018).",

    "Integrative genomics identify regulatory factors in SHH subgroup medulloblastoma. SickKids Developmental and Stem Cell Biology Seminar, Toronto, ON, Canada (2016).",

    "Characterizing the impact of single nucleotide variation in breast cancer. Dartmouth College, Hanover, NH, USA (2016) – thesis presentation."
  ],
  "posterPresentations": [
    {
      "year": "2025",
      "title": "OLIG2 mediates a rare targetable stem cell fate transition in SHH medulloblastoma",
      "conference": "21st Biennial Canadian Neuro-Oncology Meeting, Vancouver, BC, Canada",
      "award": "--"
    },
    {
      "year": "2023",
      "title": "OLIG2 mediates a rare targetable stem cell fate transition in SHH medulloblastoma",
      "conference": "SickKids Department of Stem Cell and Cancer Biology Retreat, Niagara-on-the-Lake, ON, Canada",
      "award": "Best Poster Presentation"
    },
    {
      "year": "2021",
      "title": "Targeting the transition between quiescent and activated stem cells in medulloblastoma",
      "conference": "CEEHRC 7th Annual Conference on Epigenetics (virtual)",
      "award": "--"
    },
    {
      "year": "2019",
      "title": "Integrative genomics identify OLIG2 as a regulator in SHH medulloblastoma",
      "conference": "CEEHRC Network, Banff, AB, Canada",
      "award": "Best Poster Presentation"
    },
    {
      "year": "2015",
      "title": "Functional correlation using DNase-seq identifies targets of breast cancer risk loci",
      "conference": "EACR Epigenetic Mechanisms in Cancer, Berlin, Germany",
      "award": "--"
    },
    {
      "year": "2013",
      "title": "Delineating the regulatory function of the 6q25.1 breast cancer risk-locus",
      "conference": "James Lepock Memorial Symposium, University of Toronto, Toronto, ON, Canada",
      "award": "Outstanding Poster Presentation"
    },
    {
      "year": "2012",
      "title": "Building a Human Phenotype Network on Shared Genetic Variants",
      "conference": "American Society of Human Genetics, San Francisco, CA, USA",
      "award": "Best Paper"
    },
    {
      "year": "2010",
      "title": "Molecular mechanisms of mood disorder using D. discoideum as a neuropharmacological model",
      "conference": "National Seminar on Fungal Biotechnology, Mithibai College, Mumbai, India",
      "award": "Best Poster Presentation"
    }
  ]
}